# 0 - ua
# 1 - en
# 2 - ru

welcome_message = '''
HoReCa | Job in EU – створено
для допомоги людям із України.
Тут ви можете надати роботу для
українців в інших країнах.

HoReCa | Job in EU – создан для
помощи людям из Украины. Здесь
вы можете предоставить работы
для украинцев в других странах.

HoReCa | Job in EU – created to
help people from Ukraine. Here you
can provide jobs for Ukrainians in
other countries.
'''

choose_language = '''
Оберіть будь ласка мову бота
для зручної комунікації.

Выберите пожалуйста язык
бота для удобной коммуникации.

Select please the bot language
for easy communication.
'''

what_need_to_do = ['''
》Чтобы создать объявление, вам необходимо
пройти поэтапно несколько следующих шагов:

1) Выбрать страну и город места работы
2) Указать основную информацию о заведении
3) Добавить вакансию поэтапно заполнив
4) Указать дополнительную
информацию/услуги/контакты и т.д.

В самом конце можно посмотреть, как будет
выглядеть ваше объявление, и при
необходимости изменить любую информацию

Выберите одну из стран:
''']
